README.org
The Zsh Pony
============

* Preface

  The Zsh defaults to a minimalistic configuration which doesn't show the
  potential behind this powerful and flexible shell. The Zsh ponny project
  provides a list of really hot stuff of what's possible with Zsh.

* Grml-zshrc
Grab a fully featured Zsh configuration:
#+BEGIN_EXAMPLE
% wget -O .zshrc        http://git.grml.org/f/grml-etc-core/etc/zsh/zshrc
#+END_EXAMPLE
* Switching directories for lazy people
#+BEGIN_EXAMPLE
% setopt autocd && /tmp
#+END_EXAMPLE
* Share history file amongst all Zsh sessions, ignoring dupes
#+BEGIN_EXAMPLE
% setopt append_history share_history histignorealldups
#+END_EXAMPLE
* Option Setting in Zsh, AKA setopt*
#+BEGIN_EXAMPLE
% setopt $OPTION
% man zshoptions
#+END_EXAMPLE
* Replace spaces in filenames with a underline
#+BEGIN_EXAMPLE
% autoload -U zmv
% touch 1\ 2  3\ 4\ 5
% zmv '* *' '$f:gs/ /_'
#+END_EXAMPLE
* Fast Manpage access
#+BEGIN_EXAMPLE
% autoload run-help
% echo foo | xargs <esc-h>

and then:

% git commit<esc-h>

or even ('g' being an alias for git and 'co' and git alias for commit):

% g co<esc-h>
#+END_EXAMPLE
* Completion System
** Enable completion
#+BEGIN_EXAMPLE
% autoload compinit && compinit
% kill c<tab>
% man z<tab>
% dpkg -L <tab>
#+END_EXAMPLE
** Menu Selection
#+BEGIN_EXAMPLE
% zstyle ':completion:*' menu select
#+END_EXAMPLE

Layout is :completion:FUNCTION:COMPLETER:COMMAND-OR-MAGIC-CONTEXT:ARGUMENT:TAG

Tip: Get completion help running 'ctrl-x h'.
** Use colors in completion
#+BEGIN_EXAMPLE
zstyle ':completion:*:default'         list-colors ${(s.:.)LS_COLORS}
#+END_EXAMPLE
** Pick item but stay in the menu
#+BEGIN_EXAMPLE
% bindkey -M menuselect "+" accept-and-menu-complete
% ls <tab> +
#+END_EXAMPLE
* Globbing / Glob Qualifiers
Makes find(1) useless for many jobs.
#+BEGIN_EXAMPLE
% setopt extendedglob
% rm ../debianpackage(.)   # remove files only
% ls -d *(/)               # list directories only
% ls /etc/*(@)             # list symlinks only
% ls -l *.(png|jpg|gif)    # list pictures only
% ls *(*)                  # list executables only
% ls /etc/**/zsh           # which directories contain 'zsh'?
% ls **/*(-@)              # list dangling symlinks ('**' recurses down directory trees)
% ls foo*~*bar*            # match everything that starts with foo but doesn't contain bar
#+END_EXAMPLE

The e glob qualifier -  e.g. to match all files of which file
says that they are JPEGs:

#+BEGIN_EXAMPLE
% ls *(e:'file $REPLY | grep -q JPEG':)
#+END_EXAMPLE

- (#s) or (#e) for what ^ and $ are in regexps (beginning of line/end of line)
- (#b) or (#m) to enable backreferences
- (#i) to match case insensitive
- (#a) to match approximately (certain errors are ignored, e.g. "(#a1)foo*" matches the string "ofobar")

Tip: run e.g. `ls *(<tab>` to get help regarding globbing.
#+END_EXAMPLE
* Keybindings
** Run `bindkey` to get a listing of currently active keybindings
Notes:
1) \^ := ctrl
2) \^[ := esc
** Get emacs-like keybindings
Zsh defaults to vi keybindings ('bindkey -v') if $VISUAL or $EDITOR contain string 'vi'.
Run 'bindkey -e' to get emacs-like keybindings then.
** Tip: run "bindkey ctrl-v <keys>" to find out which action is bount to a key
