README.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>The Zsh Pony</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-28 16:38:27 CEST"/>
<meta name="author" content=""/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>
<div id="content">

<h1 class="title">The Zsh Pony</h1>
<p>============
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Preface </a></li>
<li><a href="#sec-2">2 Grml-zshrc </a></li>
<li><a href="#sec-3">3 Switching directories for lazy people </a></li>
<li><a href="#sec-4">4 Share history file amongst all Zsh sessions, ignoring dupes </a></li>
<li><a href="#sec-5">5 Option Setting in Zsh, AKA setopt* </a></li>
<li><a href="#sec-6">6 Replace spaces in filenames with a underline </a></li>
<li><a href="#sec-7">7 Fast Manpage access </a></li>
<li><a href="#sec-8">8 Completion System </a>
<ul>
<li><a href="#sec-8-1">8.1 Enable completion </a></li>
<li><a href="#sec-8-2">8.2 Menu Selection </a></li>
<li><a href="#sec-8-3">8.3 Use colors in completion </a></li>
<li><a href="#sec-8-4">8.4 Pick item but stay in the menu </a></li>
</ul>
</li>
<li><a href="#sec-9">9 Globbing / Glob Qualifiers </a></li>
<li><a href="#sec-10">10 Keybindings </a>
<ul>
<li><a href="#sec-10-1">10.1 Run `bindkey` to get a listing of currently active keybindings </a></li>
<li><a href="#sec-10-2">10.2 Get emacs-like keybindings </a></li>
<li><a href="#sec-10-3">10.3 Tip: run "bindkey ctrl-v &lt;keys&gt;" to find out which action is bount to a key </a></li>
<li><a href="#sec-10-4">10.4 Some interesting keybindings </a></li>
<li><a href="#sec-10-5">10.5 Remove last part from directory name </a></li>
<li><a href="#sec-10-6">10.6 Keybindings {up,down}-line-or-search and history-beginning-search-{backward,forward}-end </a></li>
<li><a href="#sec-10-7">10.7 Incremental search with history-incremental-pattern-search-backward: </a></li>
<li><a href="#sec-10-8">10.8 Zsh Line Editor (AKA zle) </a></li>
<li><a href="#sec-10-9">10.9 Edit command line in editor </a></li>
<li><a href="#sec-10-10">10.10 Insert a timestamp on the command line (yyyy-mm-dd) </a></li>
<li><a href="#sec-10-11">10.11 Insert last typed word </a></li>
<li><a href="#sec-10-12">10.12 Complete word from history with menu </a></li>
</ul>
</li>
<li><a href="#sec-11">11 Loadable modules </a>
<ul>
<li><a href="#sec-11-1">11.1 Play tetris </a></li>
<li><a href="#sec-11-2">11.2 URL quoting </a></li>
</ul>
</li>
<li><a href="#sec-12">12 Prompt </a>
<ul>
<li><a href="#sec-12-1">12.1 Exit code in prompt, if it's not exit code 0 </a></li>
<li><a href="#sec-12-2">12.2 Special functions </a>
<ul>
<li><a href="#sec-12-2-1">12.2.1 precmd(): executed before each prompt - e.g. for setting prompt information </a></li>
<li><a href="#sec-12-2-2">12.2.2 preexec(): running before every command - e.g. for setting GNU screen title </a></li>
</ul>
</li>
<li><a href="#sec-12-3">12.3 RPOMPT with a smiley (note: the version in grml-zshrc is more sophisticated -&gt; moving smiley) </a></li>
</ul>
</li>
<li><a href="#sec-13">13 Get VCS information into your prompt - vcs_info </a></li>
<li><a href="#sec-14">14 Hashed directories </a></li>
<li><a href="#sec-15">15 On-the-fly editing of variables </a></li>
<li><a href="#sec-16">16 History </a>
<ul>
<li><a href="#sec-16-1">16.1 fc </a></li>
<li><a href="#sec-16-2">16.2 Top 10 commands </a></li>
<li><a href="#sec-16-3">16.3 Check your history for most frequently used commands and create aliases/functions for them (AKA top10): </a></li>
</ul>
</li>
<li><a href="#sec-17">17 Text replacing </a></li>
<li><a href="#sec-18">18 Suffix aliases </a></li>
<li><a href="#sec-19">19 Grml-zshrc specific stuff </a>
<ul>
<li><a href="#sec-19-1">19.1 List changelog of a Debian package </a></li>
<li><a href="#sec-19-2">19.2 In-place mkdir to create directory under cursor or the selected area </a></li>
<li><a href="#sec-19-3">19.3 Create a temporary directory and change cwd to it </a></li>
<li><a href="#sec-19-4">19.4 Directory specific shell configuration with Zsh </a></li>
<li><a href="#sec-19-5">19.5 Smart cd </a></li>
<li><a href="#sec-19-6">19.6 grml-zsh-fg </a></li>
<li><a href="#sec-19-7">19.7 sudo-command-line </a></li>
</ul>
</li>
<li><a href="#sec-20">20 Fast directory switching </a>
<ul>
<li><a href="#sec-20-1">20.1 check out "dirstack handling" in grml-zshrc for persistent directory stack feature </a></li>
</ul>
</li>
<li><a href="#sec-21">21 Speed up typing </a></li>
<li><a href="#sec-22">22 FAQ </a></li>
<li><a href="#sec-23">23 Important Resources </a></li>
<li><a href="#sec-24">24 Credits </a></li>
<li><a href="#sec-25">25 Copyright </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Preface </h2>
<div class="outline-text-2" id="text-1">


<p>
  The Zsh defaults to a minimalistic configuration which doesn't show the
  potential behind this powerful and flexible shell. The Zsh ponny project
  provides a list of really hot stuff of what's possible with Zsh.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Grml-zshrc </h2>
<div class="outline-text-2" id="text-2">

<p>Grab a fully featured Zsh configuration:
</p>


<pre class="example">% wget -O .zshrc        http://git.grml.org/f/grml-etc-core/etc/zsh/zshrc
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Switching directories for lazy people </h2>
<div class="outline-text-2" id="text-3">




<pre class="example">% setopt autocd &amp;&amp; /tmp
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Share history file amongst all Zsh sessions, ignoring dupes </h2>
<div class="outline-text-2" id="text-4">




<pre class="example">% setopt append_history share_history histignorealldups
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Option Setting in Zsh, AKA setopt* </h2>
<div class="outline-text-2" id="text-5">




<pre class="example">% setopt $OPTION
% man zshoptions
</pre>


</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> Replace spaces in filenames with a underline </h2>
<div class="outline-text-2" id="text-6">




<pre class="example">% autoload -U zmv
% touch 1\ 2  3\ 4\ 5
% zmv '* *' '$f:gs/ /_'
</pre>


</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> Fast Manpage access </h2>
<div class="outline-text-2" id="text-7">




<pre class="example">% autoload run-help
% echo foo | xargs &lt;esc-h&gt;

and then:

% git commit&lt;esc-h&gt;

or even ('g' being an alias for git and 'co' and git alias for commit):

% g co&lt;esc-h&gt;
</pre>


</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Completion System </h2>
<div class="outline-text-2" id="text-8">


</div>

<div id="outline-container-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> Enable completion </h3>
<div class="outline-text-3" id="text-8-1">




<pre class="example">% autoload compinit &amp;&amp; compinit
% kill c&lt;tab&gt;
% man z&lt;tab&gt;
% dpkg -L &lt;tab&gt;
</pre>


</div>

</div>

<div id="outline-container-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> Menu Selection </h3>
<div class="outline-text-3" id="text-8-2">




<pre class="example">% zstyle ':completion:*' menu select
</pre>



<p>
Layout is :completion:FUNCTION:COMPLETER:COMMAND-OR-MAGIC-CONTEXT:ARGUMENT:TAG
</p>
<p>
Tip: Get completion help running 'ctrl-x h'.
</p></div>

</div>

<div id="outline-container-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> Use colors in completion </h3>
<div class="outline-text-3" id="text-8-3">




<pre class="example">zstyle ':completion:*:default'         list-colors ${(s.:.)LS_COLORS}
</pre>


</div>

</div>

<div id="outline-container-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> Pick item but stay in the menu </h3>
<div class="outline-text-3" id="text-8-4">




<pre class="example">% bindkey -M menuselect "+" accept-and-menu-complete
% ls &lt;tab&gt; +
</pre>


</div>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9"><span class="section-number-2">9</span> Globbing / Glob Qualifiers </h2>
<div class="outline-text-2" id="text-9">

<p>Makes find(1) useless for many jobs.
</p>


<pre class="example">% setopt extendedglob
% rm ../debianpackage(.)   # remove files only
% ls -d *(/)               # list directories only
% ls /etc/*(@)             # list symlinks only
% ls -l *.(png|jpg|gif)    # list pictures only
% ls *(*)                  # list executables only
% ls /etc/**/zsh           # which directories contain 'zsh'?
% ls **/*(-@)              # list dangling symlinks ('**' recurses down directory trees)
% ls foo*~*bar*            # match everything that starts with foo but doesn't contain bar
</pre>



<p>
The e glob qualifier -  e.g. to match all files of which file
says that they are JPEGs:
</p>



<pre class="example">% ls *(e:'file $REPLY | grep -q JPEG':)
</pre>



<ul>
<li>(#s) or (#e) for what ^ and $ are in regexps (beginning of line/end of line)
</li>
<li>(#b) or (#m) to enable backreferences
</li>
<li>(#i) to match case insensitive
</li>
<li>(#a) to match approximately (certain errors are ignored, e.g. "(#a1)foo*" matches the string "ofobar")
</li>
</ul>


<p>
Tip: run e.g. `ls *(&lt;tab&gt;` to get help regarding globbing.
</p></div>

</div>

<div id="outline-container-10" class="outline-2">
<h2 id="sec-10"><span class="section-number-2">10</span> Keybindings </h2>
<div class="outline-text-2" id="text-10">


</div>

<div id="outline-container-10-1" class="outline-3">
<h3 id="sec-10-1"><span class="section-number-3">10.1</span> Run `bindkey` to get a listing of currently active keybindings </h3>
<div class="outline-text-3" id="text-10-1">

<p>Notes:
</p><ol>
<li>^ := ctrl
</li>
<li>^[ := esc
</li>
</ol>

</div>

</div>

<div id="outline-container-10-2" class="outline-3">
<h3 id="sec-10-2"><span class="section-number-3">10.2</span> Get emacs-like keybindings </h3>
<div class="outline-text-3" id="text-10-2">

<p>Zsh defaults to vi keybindings ('bindkey -v') if $VISUAL or $EDITOR contain string 'vi'.
Run 'bindkey -e' to get emacs-like keybindings then.
</p></div>

</div>

<div id="outline-container-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> Tip: run "bindkey ctrl-v &lt;keys&gt;" to find out which action is bount to a key </h3>
<div class="outline-text-3" id="text-10-3">

</div>

</div>
