README.org
** Some interesting keybindings
| Keybinding | Meaning                                                            |
|------------+--------------------------------------------------------------------|
| ctrl-d     | complete + EOF                                                     |
| ctrl-l     | clear screen                                                       |
| ctrl-w     | delete last word                                                   |
| ctrl-\_    | undo                                                               |
| tab        | complete and take first result                                     |
| esc-.      | insert last parameter of last typed command (similar to typing !$) |
| ctrl-a     | begin of line                                                      |
| ctrl-e     | end of line                                                        |
| alt-'      | quote-line ('')                                                    |
| alt-?      | which-command                                                      |
| ctrl-k     | kill line                                                          |
| ctrl-u     | kill while line (kill-ring)                                        |
| ctrl-w     | copy last word (kill-ring)                                         |
| ctrl-y     | yank (insert kill-ring)                                            |
| esc-q      | push line                                                          |
** Remove last part from directory name
#+BEGIN_EXAMPLE
% cd /usr/share/doc/mutt/examples/<alt+backspace>
% echo $WORDCHARS
*?_-.[]~=/&;!#$%^(){}<>
#+END_EXAMPLE
** Keybindings {up,down}-line-or-search and history-beginning-search-{backward,forward}-end
#+BEGIN_EXAMPLE
% echo 123
% echo 234
% ls
and then:
% echo <cursor-up|down>
vs.
% echo 2<page-up|down>
#+END_EXAMPLE
** Incremental search with history-incremental-pattern-search-backward:
#+BEGIN_EXAMPLE
% <ctrl-r>scp*r
#+END_EXAMPLE
** Zsh Line Editor (AKA zle)
1) It's what readline is for bash (move, delete, copy words/lines/...)
2) Basic layout of custom widgets, used like functions:
#+BEGIN_EXAMPLE
% foobar() { LBUFFER="foobar $LBUFFER"; } # function
% zle -N foobar         # declare function as bindable widget
% bindkey '^x^s' foobar # bind command to a keybinding
#+END_EXAMPLE
3) ctrl-x-z provides help_zle_parse_keybindings in grml-zshrc
** Edit command line in editor
#+BEGIN_EXAMPLE
% autoload edit-command-line && zle -N edit-command-line
% bindkey '\ee' edit-command-line
% $SOME_COMMAND_LINE <esc-e>
#+END_EXAMPLE
** Insert a timestamp on the command line (yyyy-mm-dd)
#+BEGIN_EXAMPLE
insert-datestamp() { LBUFFER+=${(%):-'%D{%Y-%m-%d}'}; }
zle -N insert-datestamp
bindkey '^Ed' insert-datestamp
#+END_EXAMPLE
** Insert last typed word
#+BEGIN_EXAMPLE
% insert-last-typed-word() { zle insert-last-word -- 0 -1 };
% zle -N insert-last-typed-word;
% bindkey "\em" insert-last-typed-word
% mv foobar <esc-m>
#+END_EXAMPLE
** Complete word from history with menu
#+BEGIN_EXAMPLE
% zle -C hist-complete complete-word _generic
% zstyle ':completion:hist-complete:*' completer _history
% bindkey "^X^X" hist-complete
#+END_EXAMPLE
* Loadable modules
** Play tetris
#+BEGIN_EXAMPLE
% autoload -U tetris
% tetris
#+END_EXAMPLE
** URL quoting
#+BEGIN_EXAMPLE
% autoload -U url-quote-magic
% zle -N self-insert url-quote-magic
#+END_EXAMPLE
Disclaimer: annoying when using e.g. http://example.org/foo{1,2,3}.tgz
* Prompt
#+BEGIN_EXAMPLE
% autoload -U promptinit
% promptinit
% prompt fire
% prompt <tab>
#+END_EXAMPLE
** Exit code in prompt, if it's not exit code 0
** Special functions
*** precmd(): executed before each prompt - e.g. for setting prompt information
*** preexec(): running before every command - e.g. for setting GNU screen title
** RPOMPT with a smiley (note: the version in grml-zshrc is more sophisticated -> moving smiley)
#+BEGIN_EXAMPLE
precmd () { RPROMPT="%(?..:()%" }
#+END_EXAMPLE
* Get VCS information into your prompt - vcs\_info
#+BEGIN_EXAMPLE
autoload -Uz vcs_info
precmd() {
  psvar=()
  vcs_info
  [[ -n $vcs_info_msg_0_ ]] && psvar[1]="$vcs_info_msg_0_"
}
PS1="%m%(1v.%F{green}%1v%f.)%# "
#+END_EXAMPLE
* Hashed directories
#+BEGIN_EXAMPLE
% hash -d doc=/usr/share/doc
% cd ~doc
% hash -d deb=/var/cache/apt/archives
% sudo dpkg -i ~deb/foobar*deb
#+END_EXAMPLE
* On-the-fly editing of variables
#+BEGIN_EXAMPLE
% vared PATH
#+END_EXAMPLE
* History
Supports csh style bang history expansion.
#+BEGIN_EXAMPLE
% history  # last 16 events
% history -E 0  # all history events including date/time information
% !23      # Re-execute history command 23
% !!       # The last command.
% !$       # Last word of the last command.
% !-2      # The last but one command.
% !-2$     # The last word of the command before the last command.
% !#$      # The last word of the current command line.
% !#0      # The first word of the current command line.
% !?foo    # The last command that matches the pattern `foo'.
% !?foo?1  # The second word of the last command line that matches `foo'.
#+END_EXAMPLE

...and that's really just the start. History expansion is extremely versatile
and powerful - but also a bit cryptic for the untrained eye. Practice, young
padawan, makes perfect. .o( man zshexpn | less -p '\^HISTO.*ANSION$' )
** fc
+ fc -p/fc -a/fc -P deals with the "history stack"
+ "fc -p" clears out the current history and starts with a new one,
  until you run fc -P, which will restore the old history again
+ You can use that to "bind" certain histories to specific directories.
** Top 10 commands
