README.html

<div id="outline-container-10-4" class="outline-3">
<h3 id="sec-10-4"><span class="section-number-3">10.4</span> Some interesting keybindings </h3>
<div class="outline-text-3" id="text-10-4">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Keybinding</th><th scope="col" class="left">Meaning</th></tr>
</thead>
<tbody>
<tr><td class="left">ctrl-d</td><td class="left">complete + EOF</td></tr>
<tr><td class="left">ctrl-l</td><td class="left">clear screen</td></tr>
<tr><td class="left">ctrl-w</td><td class="left">delete last word</td></tr>
<tr><td class="left">ctrl-_</td><td class="left">undo</td></tr>
<tr><td class="left">tab</td><td class="left">complete and take first result</td></tr>
<tr><td class="left">esc-.</td><td class="left">insert last parameter of last typed command (similar to typing !$)</td></tr>
<tr><td class="left">ctrl-a</td><td class="left">begin of line</td></tr>
<tr><td class="left">ctrl-e</td><td class="left">end of line</td></tr>
<tr><td class="left">alt-'</td><td class="left">quote-line ('')</td></tr>
<tr><td class="left">alt-?</td><td class="left">which-command</td></tr>
<tr><td class="left">ctrl-k</td><td class="left">kill line</td></tr>
<tr><td class="left">ctrl-u</td><td class="left">kill while line (kill-ring)</td></tr>
<tr><td class="left">ctrl-w</td><td class="left">copy last word (kill-ring)</td></tr>
<tr><td class="left">ctrl-y</td><td class="left">yank (insert kill-ring)</td></tr>
<tr><td class="left">esc-q</td><td class="left">push line</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-10-5" class="outline-3">
<h3 id="sec-10-5"><span class="section-number-3">10.5</span> Remove last part from directory name </h3>
<div class="outline-text-3" id="text-10-5">




<pre class="example">% cd /usr/share/doc/mutt/examples/&lt;alt+backspace&gt;
% echo $WORDCHARS
*?_-.[]~=/&amp;;!#$%^(){}&lt;&gt;
</pre>


</div>

</div>

<div id="outline-container-10-6" class="outline-3">
<h3 id="sec-10-6"><span class="section-number-3">10.6</span> Keybindings {up,down}-line-or-search and history-beginning-search-{backward,forward}-end </h3>
<div class="outline-text-3" id="text-10-6">




<pre class="example">% echo 123
% echo 234
% ls
and then:
% echo &lt;cursor-up|down&gt;
vs.
% echo 2&lt;page-up|down&gt;
</pre>


</div>

</div>

<div id="outline-container-10-7" class="outline-3">
<h3 id="sec-10-7"><span class="section-number-3">10.7</span> Incremental search with history-incremental-pattern-search-backward: </h3>
<div class="outline-text-3" id="text-10-7">




<pre class="example">% &lt;ctrl-r&gt;scp*r
</pre>


</div>

</div>

<div id="outline-container-10-8" class="outline-3">
<h3 id="sec-10-8"><span class="section-number-3">10.8</span> Zsh Line Editor (AKA zle) </h3>
<div class="outline-text-3" id="text-10-8">

<ol>
<li>It's what readline is for bash (move, delete, copy words/lines/&hellip;)
</li>
<li>Basic layout of custom widgets, used like functions:
</li>
</ol>




<pre class="example">% foobar() { LBUFFER="foobar $LBUFFER"; } # function
% zle -N foobar         # declare function as bindable widget
% bindkey '^x^s' foobar # bind command to a keybinding
</pre>


<ol>
<li>ctrl-x-z provides help<sub>zle</sub><sub>parse</sub><sub>keybindings</sub> in grml-zshrc
</li>
</ol>

</div>

</div>

<div id="outline-container-10-9" class="outline-3">
<h3 id="sec-10-9"><span class="section-number-3">10.9</span> Edit command line in editor </h3>
<div class="outline-text-3" id="text-10-9">




<pre class="example">% autoload edit-command-line &amp;&amp; zle -N edit-command-line
% bindkey '\ee' edit-command-line
% $SOME_COMMAND_LINE &lt;esc-e&gt;
</pre>


</div>

</div>

<div id="outline-container-10-10" class="outline-3">
<h3 id="sec-10-10"><span class="section-number-3">10.10</span> Insert a timestamp on the command line (yyyy-mm-dd) </h3>
<div class="outline-text-3" id="text-10-10">




<pre class="example">insert-datestamp() { LBUFFER+=${(%):-'%D{%Y-%m-%d}'}; }
zle -N insert-datestamp
bindkey '^Ed' insert-datestamp
</pre>


</div>

</div>

<div id="outline-container-10-11" class="outline-3">
<h3 id="sec-10-11"><span class="section-number-3">10.11</span> Insert last typed word </h3>
<div class="outline-text-3" id="text-10-11">




<pre class="example">% insert-last-typed-word() { zle insert-last-word -- 0 -1 };
% zle -N insert-last-typed-word;
% bindkey "\em" insert-last-typed-word
% mv foobar &lt;esc-m&gt;
</pre>


</div>

</div>

<div id="outline-container-10-12" class="outline-3">
<h3 id="sec-10-12"><span class="section-number-3">10.12</span> Complete word from history with menu </h3>
<div class="outline-text-3" id="text-10-12">




<pre class="example">% zle -C hist-complete complete-word _generic
% zstyle ':completion:hist-complete:*' completer _history
% bindkey "^X^X" hist-complete
</pre>


</div>
</div>

</div>

<div id="outline-container-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Loadable modules </h2>
<div class="outline-text-2" id="text-11">


</div>

<div id="outline-container-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Play tetris </h3>
<div class="outline-text-3" id="text-11-1">




<pre class="example">% autoload -U tetris
% tetris
</pre>


</div>

</div>

<div id="outline-container-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> URL quoting </h3>
<div class="outline-text-3" id="text-11-2">




<pre class="example">% autoload -U url-quote-magic
% zle -N self-insert url-quote-magic
</pre>


<p>
Disclaimer: annoying when using e.g. <a href="http://example.org/foo{1,2,3}.tgz">http://example.org/foo{1,2,3}.tgz</a>
</p></div>
</div>

</div>

<div id="outline-container-12" class="outline-2">
<h2 id="sec-12"><span class="section-number-2">12</span> Prompt </h2>
<div class="outline-text-2" id="text-12">




<pre class="example">% autoload -U promptinit
% promptinit
% prompt fire
% prompt &lt;tab&gt;
</pre>



</div>

<div id="outline-container-12-1" class="outline-3">
<h3 id="sec-12-1"><span class="section-number-3">12.1</span> Exit code in prompt, if it's not exit code 0 </h3>
<div class="outline-text-3" id="text-12-1">

</div>

</div>

<div id="outline-container-12-2" class="outline-3">
<h3 id="sec-12-2"><span class="section-number-3">12.2</span> Special functions </h3>
<div class="outline-text-3" id="text-12-2">


</div>

<div id="outline-container-12-2-1" class="outline-4">
<h4 id="sec-12-2-1"><span class="section-number-4">12.2.1</span> precmd(): executed before each prompt - e.g. for setting prompt information </h4>
<div class="outline-text-4" id="text-12-2-1">

</div>

</div>

<div id="outline-container-12-2-2" class="outline-4">
<h4 id="sec-12-2-2"><span class="section-number-4">12.2.2</span> preexec(): running before every command - e.g. for setting GNU screen title </h4>
<div class="outline-text-4" id="text-12-2-2">

</div>
</div>

</div>

<div id="outline-container-12-3" class="outline-3">
<h3 id="sec-12-3"><span class="section-number-3">12.3</span> RPOMPT with a smiley (note: the version in grml-zshrc is more sophisticated -&gt; moving smiley) </h3>
<div class="outline-text-3" id="text-12-3">




<pre class="example">precmd () { RPROMPT="%(?..:()%" }
</pre>


</div>
</div>

</div>

<div id="outline-container-13" class="outline-2">
<h2 id="sec-13"><span class="section-number-2">13</span> Get VCS information into your prompt - vcs_info </h2>
<div class="outline-text-2" id="text-13">




<pre class="example">autoload -Uz vcs_info
precmd() {
  psvar=()
  vcs_info
  [[ -n $vcs_info_msg_0_ ]] &amp;&amp; psvar[1]="$vcs_info_msg_0_"
}
PS1="%m%(1v.%F{green}%1v%f.)%# "
</pre>


</div>

</div>

<div id="outline-container-14" class="outline-2">
<h2 id="sec-14"><span class="section-number-2">14</span> Hashed directories </h2>
<div class="outline-text-2" id="text-14">




<pre class="example">% hash -d doc=/usr/share/doc
% cd ~doc
% hash -d deb=/var/cache/apt/archives
% sudo dpkg -i ~deb/foobar*deb
</pre>


</div>

</div>

<div id="outline-container-15" class="outline-2">
<h2 id="sec-15"><span class="section-number-2">15</span> On-the-fly editing of variables </h2>
<div class="outline-text-2" id="text-15">




<pre class="example">% vared PATH
</pre>


</div>

</div>

<div id="outline-container-16" class="outline-2">
<h2 id="sec-16"><span class="section-number-2">16</span> History </h2>
<div class="outline-text-2" id="text-16">

<p>Supports csh style bang history expansion.
</p>


<pre class="example">% history  # last 16 events
% history -E 0  # all history events including date/time information
% !23      # Re-execute history command 23
% !!       # The last command.
% !$       # Last word of the last command.
% !-2      # The last but one command.
% !-2$     # The last word of the command before the last command.
% !#$      # The last word of the current command line.
% !#0      # The first word of the current command line.
% !?foo    # The last command that matches the pattern `foo'.
% !?foo?1  # The second word of the last command line that matches `foo'.
</pre>



<p>
&hellip;and that's really just the start. History expansion is extremely versatile
and powerful - but also a bit cryptic for the untrained eye. Practice, young
padawan, makes perfect. .o( man zshexpn | less -p '^HISTO.*ANSION$' )
</p>
</div>

<div id="outline-container-16-1" class="outline-3">
<h3 id="sec-16-1"><span class="section-number-3">16.1</span> fc </h3>
<div class="outline-text-3" id="text-16-1">

<ul>
<li>fc -p/fc -a/fc -P deals with the "history stack"
</li>
<li>"fc -p" clears out the current history and starts with a new one,
  until you run fc -P, which will restore the old history again
</li>
<li>You can use that to "bind" certain histories to specific directories.
</li>
</ul>

</div>

</div>
