README.org
** Check your history for most frequently used commands and create aliases/functions for them (AKA top10):
#+BEGIN_EXAMPLE
% print -l -- ${(o)history%% *} | uniq -c | sort -nr | head -n 10
#+END_EXAMPLE
* Text replacing
#+BEGIN_EXAMPLE
% mkdir -p /tmp/linux-2.6.3{8,9}/demo
% cd /tmp/linux-2.6.38/demo
% cd 38 <tab>

% echo foo
% ^foo^bar

% echo foo_bar
% echo !$:s/foo/baz/
#+END_EXAMPLE
* Suffix aliases
#+BEGIN_EXAMPLE
% alias -s txt=vim
% foobar.txt
% alias -s pdf=xpdf
% print.pdf
#+END_EXAMPLE
* Grml-zshrc specific stuff
** List changelog of a Debian package
#+BEGIN_EXAMPLE
% dchange $DEBIAN_PACKAGE
#+END_EXAMPLE
** In-place mkdir to create directory under cursor or the selected area
#+BEGIN_EXAMPLE
% cp file /tmp/doesnotexist/<ctrl-xM>
#+END_EXAMPLE
** Create a temporary directory and change cwd to it
#+BEGIN_EXAMPLE
% cdt
#+END_EXAMPLE
** Directory specific shell configuration with Zsh
See http://michael-prokop.at/blog/2009/05/30/directory-specific-shell-configuration-with-zsh/
Hint: do you remember the fc section? You can combine the directory specific shell configuration with 'fc -p $file'!
** Smart cd
#+BEGIN_EXAMPLE
% which cd
cd () {
        if [[ -f ${1} ]]
        then
                [[ ! -e ${1:h} ]] && return 1
                print "Correcting ${1} to ${1:h}"
                builtin cd ${1:h}
        else
                builtin cd ${1}
        fi
}
% cd /etc/fstab
#+END_EXAMPLE
** grml-zsh-fg
#+BEGIN_EXAMPLE
% vim # ... <ctrl-z>
% echo foobar
% <ctrl-z>
#+END_EXAMPLE
** sudo-command-line
#+BEGIN_EXAMPLE
% which sudo-command-line
sudo-command-line () {
        [[ -z $BUFFER ]] && zle up-history
        if [[ $BUFFER != sudo\ * ]]
        then
                BUFFER="sudo $BUFFER"
                CURSOR=$(( CURSOR+5 ))
        fi
}
% gparted /dev/sda <ctrl-o s>
#+END_EXAMPLE
* Fast directory switching
#+BEGIN_EXAMPLE
% cd -<tab>
#+END_EXAMPLE
** check out "dirstack handling" in grml-zshrc for persistent directory stack feature
* Speed up typing
| Long version                           | Short version                                           |
|----------------------------------------+---------------------------------------------------------|
| for i in $(seq 2 9); do echo $i ; done | for i in {2..9}; echo $i                                |
| ls $(which vim)                        | ls =vim                                                 |
| cat bar baz $PIPECHAR sort             | sort <b{ar,az}                                          |
| ls /usr/share/doc/mutt/examples        | ls /u/s/d/m/e<tab>                                      |
| gzip -cd foo.gz && less foo            | less <(gzip -cd foo.gz)                                 |
| ls >file1; ls >file2; ls >file3        | ls >file1 >file2 >file3                                 |
| -                                      | less <file1 <file2                                      |
| -                                      | diff <(sort foo) <(sort bar)                            |
| -                                      | xpdf =(zcat ~doc/grml-docs/zsh/grml-zsh-refcard.pdf.gz) |
#+END_EXAMPLE
* FAQ
1) Q: How to I get a listing of all my currently in use options?

  Answer:
  #+BEGIN_EXAMPLE
  setopt ksh_option_print && setopt

or:

  printf '%s=%s\n' "${(@kv)options}"
  #+END_EXAMPLE
2) Q: Why do I get "zsh: command not found:" even though I just installed the program?

  Answer: execute:
  #+BEGIN_EXAMPLE
  % rehash
  #+END_EXAMPLE
  or use completion system as provided by grml-zshrc (completion will rehash automatically).
3) Q: What's this strange word splitting thing?

  Answer: see http://zsh.sourceforge.net/FAQ/zshfaq03.html
  #+BEGIN_EXAMPLE
  % var="foo bar"
  % args() { echo $#; }
  % args $var
  1
  % setopt shwordsplit
  % args $var
  2
  #+END_EXAMPLE
* Important Resources
1) Zsh Homepage: http://zsh.sourceforge.net/
2) Zsh Wiki: http://zshwiki.org
3) Zsh Manpages: man zshall
4) Zsh Reference Card: http://www.bash2zsh.com/zsh_refcard/refcard.pdf
5) User's Guide to ZSH: http://zsh.sourceforge.net/Guide/ (old but still interesting)
6) Zsh Talk by caphuso:  http://ft.bewatermyfriend.org/comp/zshtalk.html
7) English Book: http://www.bash2zsh.com/
8) German Book: http://zshbuch.org/
9) Grml's Zsh stuff: http://grml.org/zsh/

* Credits

Thanks to Frank Terbeck for reviewing and his valuable feedback (which isn't limited to this document :)).

* Copyright
(c) 2011 by Michael Prokop <mika@grml.org>

* Feedback

#+BEGIN_EXAMPLE
% git clone git://github.com/mika/zsh-pony
#+END_EXAMPLE
