README.html

<div id="outline-container-16-2" class="outline-3">
<h3 id="sec-16-2"><span class="section-number-3">16.2</span> Top 10 commands </h3>
<div class="outline-text-3" id="text-16-2">

</div>

</div>

<div id="outline-container-16-3" class="outline-3">
<h3 id="sec-16-3"><span class="section-number-3">16.3</span> Check your history for most frequently used commands and create aliases/functions for them (AKA top10): </h3>
<div class="outline-text-3" id="text-16-3">




<pre class="example">% print -l -- ${(o)history%% *} | uniq -c | sort -nr | head -n 10
</pre>


</div>
</div>

</div>

<div id="outline-container-17" class="outline-2">
<h2 id="sec-17"><span class="section-number-2">17</span> Text replacing </h2>
<div class="outline-text-2" id="text-17">




<pre class="example">% mkdir -p /tmp/linux-2.6.3{8,9}/demo
% cd /tmp/linux-2.6.38/demo
% cd 38 &lt;tab&gt;

% echo foo
% ^foo^bar

% echo foo_bar
% echo !$:s/foo/baz/
</pre>


</div>

</div>

<div id="outline-container-18" class="outline-2">
<h2 id="sec-18"><span class="section-number-2">18</span> Suffix aliases </h2>
<div class="outline-text-2" id="text-18">




<pre class="example">% alias -s txt=vim
% foobar.txt
% alias -s pdf=xpdf
% print.pdf
</pre>


</div>

</div>

<div id="outline-container-19" class="outline-2">
<h2 id="sec-19"><span class="section-number-2">19</span> Grml-zshrc specific stuff </h2>
<div class="outline-text-2" id="text-19">


</div>

<div id="outline-container-19-1" class="outline-3">
<h3 id="sec-19-1"><span class="section-number-3">19.1</span> List changelog of a Debian package </h3>
<div class="outline-text-3" id="text-19-1">




<pre class="example">% dchange $DEBIAN_PACKAGE
</pre>


</div>

</div>

<div id="outline-container-19-2" class="outline-3">
<h3 id="sec-19-2"><span class="section-number-3">19.2</span> In-place mkdir to create directory under cursor or the selected area </h3>
<div class="outline-text-3" id="text-19-2">




<pre class="example">% cp file /tmp/doesnotexist/&lt;ctrl-xM&gt;
</pre>


</div>

</div>

<div id="outline-container-19-3" class="outline-3">
<h3 id="sec-19-3"><span class="section-number-3">19.3</span> Create a temporary directory and change cwd to it </h3>
<div class="outline-text-3" id="text-19-3">




<pre class="example">% cdt
</pre>


</div>

</div>

<div id="outline-container-19-4" class="outline-3">
<h3 id="sec-19-4"><span class="section-number-3">19.4</span> Directory specific shell configuration with Zsh </h3>
<div class="outline-text-3" id="text-19-4">

<p>See <a href="http://michael-prokop.at/blog/2009/05/30/directory-specific-shell-configuration-with-zsh/">http://michael-prokop.at/blog/2009/05/30/directory-specific-shell-configuration-with-zsh/</a>
Hint: do you remember the fc section? You can combine the directory specific shell configuration with 'fc -p $file'!
</p></div>

</div>

<div id="outline-container-19-5" class="outline-3">
<h3 id="sec-19-5"><span class="section-number-3">19.5</span> Smart cd </h3>
<div class="outline-text-3" id="text-19-5">




<pre class="example">% which cd
cd () {
        if [[ -f ${1} ]]
        then
                [[ ! -e ${1:h} ]] &amp;&amp; return 1
                print "Correcting ${1} to ${1:h}"
                builtin cd ${1:h}
        else
                builtin cd ${1}
        fi
}
% cd /etc/fstab
</pre>


</div>

</div>

<div id="outline-container-19-6" class="outline-3">
<h3 id="sec-19-6"><span class="section-number-3">19.6</span> grml-zsh-fg </h3>
<div class="outline-text-3" id="text-19-6">




<pre class="example">% vim # ... &lt;ctrl-z&gt;
% echo foobar
% &lt;ctrl-z&gt;
</pre>


</div>

</div>

<div id="outline-container-19-7" class="outline-3">
<h3 id="sec-19-7"><span class="section-number-3">19.7</span> sudo-command-line </h3>
<div class="outline-text-3" id="text-19-7">




<pre class="example">% which sudo-command-line
sudo-command-line () {
        [[ -z $BUFFER ]] &amp;&amp; zle up-history
        if [[ $BUFFER != sudo\ * ]]
        then
                BUFFER="sudo $BUFFER"
                CURSOR=$(( CURSOR+5 ))
        fi
}
% gparted /dev/sda &lt;ctrl-o s&gt;
</pre>


</div>
</div>

</div>

<div id="outline-container-20" class="outline-2">
<h2 id="sec-20"><span class="section-number-2">20</span> Fast directory switching </h2>
<div class="outline-text-2" id="text-20">




<pre class="example">% cd -&lt;tab&gt;
</pre>



</div>

<div id="outline-container-20-1" class="outline-3">
<h3 id="sec-20-1"><span class="section-number-3">20.1</span> check out "dirstack handling" in grml-zshrc for persistent directory stack feature </h3>
<div class="outline-text-3" id="text-20-1">

</div>
</div>

</div>

<div id="outline-container-21" class="outline-2">
<h2 id="sec-21"><span class="section-number-2">21</span> Speed up typing </h2>
<div class="outline-text-2" id="text-21">

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">Long version</th><th scope="col" class="left">Short version</th></tr>
</thead>
<tbody>
<tr><td class="left">for i in $(seq 2 9); do echo $i ; done</td><td class="left">for i in {2..9}; echo $i</td></tr>
<tr><td class="left">ls $(which vim)</td><td class="left">ls =vim</td></tr>
<tr><td class="left">cat bar baz $PIPECHAR sort</td><td class="left">sort &lt;b{ar,az}</td></tr>
<tr><td class="left">ls /usr/share/doc/mutt/examples</td><td class="left">ls /u/s/d/m/e&lt;tab&gt;</td></tr>
<tr><td class="left">gzip -cd foo.gz &amp;&amp; less foo</td><td class="left">less &lt;(gzip -cd foo.gz)</td></tr>
<tr><td class="left">ls &gt;file1; ls &gt;file2; ls &gt;file3</td><td class="left">ls &gt;file1 &gt;file2 &gt;file3</td></tr>
<tr><td class="left">-</td><td class="left">less &lt;file1 &lt;file2</td></tr>
<tr><td class="left">-</td><td class="left">diff &lt;(sort foo) &lt;(sort bar)</td></tr>
<tr><td class="left">-</td><td class="left">xpdf =(zcat ~doc/grml-docs/zsh/grml-zsh-refcard.pdf.gz)</td></tr>
</tbody>
</table>

</div>

</div>

<div id="outline-container-22" class="outline-2">
<h2 id="sec-22"><span class="section-number-2">22</span> FAQ </h2>
<div class="outline-text-2" id="text-22">

<ol>
<li>Q: How to I get a listing of all my currently in use options?

<p>
  Answer:
</p>


<pre class="example">  setopt ksh_option_print &amp;&amp; setopt

or:

  printf '%s=%s\n' "${(@kv)options}"
</pre>


</li>
<li>Q: Why do I get "zsh: command not found:" even though I just installed the program?

<p>
  Answer: execute:
</p>


<pre class="example">% rehash
</pre>


<p>
  or use completion system as provided by grml-zshrc (completion will rehash automatically).
</p></li>
<li>Q: What's this strange word splitting thing?

<p>
  Answer: see <a href="http://zsh.sourceforge.net/FAQ/zshfaq03.html">http://zsh.sourceforge.net/FAQ/zshfaq03.html</a>
</p>


<pre class="example">% var="foo bar"
% args() { echo $#; }
% args $var
1
% setopt shwordsplit
% args $var
2
</pre>


</li>
</ol>

</div>

</div>

<div id="outline-container-23" class="outline-2">
<h2 id="sec-23"><span class="section-number-2">23</span> Important Resources </h2>
<div class="outline-text-2" id="text-23">

<ol>
<li>Zsh Homepage: <a href="http://zsh.sourceforge.net/">http://zsh.sourceforge.net/</a>
</li>
<li>Zsh Wiki: <a href="http://zshwiki.org">http://zshwiki.org</a>
</li>
<li>Zsh Manpages: man zshall
</li>
<li>Zsh Reference Card: <a href="http://www.bash2zsh.com/zsh_refcard/refcard.pdf">http://www.bash2zsh.com/zsh_refcard/refcard.pdf</a>
</li>
<li>User's Guide to ZSH: <a href="http://zsh.sourceforge.net/Guide/">http://zsh.sourceforge.net/Guide/</a> (old but still interesting)
</li>
<li>Zsh Talk by caphuso:  <a href="http://ft.bewatermyfriend.org/comp/zshtalk.html">http://ft.bewatermyfriend.org/comp/zshtalk.html</a>
</li>
<li>English Book: <a href="http://www.bash2zsh.com/">http://www.bash2zsh.com/</a>
</li>
<li>German Book: <a href="http://zshbuch.org/">http://zshbuch.org/</a>
</li>
<li>Grml's Zsh stuff: <a href="http://grml.org/zsh/">http://grml.org/zsh/</a>
</li>
</ol>


</div>

</div>

<div id="outline-container-24" class="outline-2">
<h2 id="sec-24"><span class="section-number-2">24</span> Credits </h2>
<div class="outline-text-2" id="text-24">


<p>
Thanks to Frank Terbeck for reviewing and his valuable feedback (which isn't limited to this document :)).
</p>
</div>

</div>

<div id="outline-container-25" class="outline-2">
<h2 id="sec-25"><span class="section-number-2">25</span> Copyright </h2>
<div class="outline-text-2" id="text-25">

<p>(c) 2011 by Michael Prokop &lt;mika@grml.org&gt;
</p>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">
<p class="footnote"><sup><a class="footnum" name="fn.1" href="#fnr.1">1</a></sup> DEFINITION NOT FOUND: 1
</p>
</div>
</div>

</div>
</div>
<div id="postamble">
<p class="date">Date: 2011-07-28 16:38:27 CEST</p>
<p class="author">Author: </p>
<p class="creator">Org version 7.6 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>
</div>
</div>
</body>
</html>
